N = 6
a = [0] * N
for i in range(N):
    a[i] = i ** 2
print(a)

# --------------------------------------------------
# List comprehension
# --------------------------------------------------
a = [i ** 2 for i in range(N)]
print(a)

# --------------------------------------------------
# [<способ формирования значения> for <имя переменной> in <итеррированный обьект>]
# --------------------------------------------------
a = [1 for i in range(N)]
print(a)

a = [x % 4 == 0 for x in range(N)]
print(a)

a = [0.5 * x + 1 for x in range(N)]
print(a)

# --------------------------------------------------

d_inp = input('Введите числа через пробел: ')
a = [int(x) for x in d_inp.split()]
print(a)

d = "Python"
a = [x.upper() for x in d]
print(a)

t = ["Я", "Учу", "Python", "!", "Я", "Учу", "Python", "!"]
a = [len(x) for x in t ]
print(a)

# --------------------------------------------------
d = [x for x in range(-5, 5) if x % 2 == 0]
print(d)

cities = ["Москва", "Санкт-Петербург", "Новосибирск", "Екатеринбург"]
a = [city for city in cities if len(city) > 7]
print(a)

# --------------------------------------------------
# тернарный оператор
# --------------------------------------------------
d = [4, 3 ,-5, 0, 2, 11, 122, -8, 9, -1]
a = ["четное" if x % 2 == 0 else "нечетное" for x in d]
print(a)