print("....................... 29_dictionaries.py ..")

d = {'hous':'дом', 'car':'машина',
     'tree':'дерево', 'road':'дорога'} # Только один раз можно использовать ключи в качестве имен переменных

print(d)
print(d['hous'])
print(d['car'])

d2 = dict(one=1, two=2, three=3)
print(d2)
lst = [['one', 1], ['two', 2], ['three', 3]]
d3 = dict(lst)
print(d3)

d4 = {}
d4[True] = 'Да'
d4[False] = 'Нет'
print(d4)
d4['list'] = [1, 2, 3]
print(d4)
del d4[True] # Удаление по ключу True из словаря d4
print(d4)
# Проверка наличия ключа в словаре
print('list' in d4)
if 'list' in d4:
    print("list from d4: ",d4['list'])

if True not in d4:
    d4[True] = 'Да'
print('Добавил True: ', d4)


###
# Задачи
# Задача 1
# Вводятся номера телефонов в одну строчку через пробел с разными кодами стран: +7, +6, +2, +4 и т.д. Необходимо составить словарь d, где ключи - это коды +7, +6, +2 и т.п., а значения - список номеров (следующих в том же порядке, что и во входной строке) с соответствующими кодами. Полученный словарь вывести командой:

# print(*sorted(d.items()))

# Sample Input:
# +71234567890 +71234567854 +61234576890 +52134567890 +21235777890 +21234567110 +71232267890
# Sample Output:
# ('+2', ['+21235777890', '+21234567110']) ('+5', ['+52134567890']) ('+6', ['+61234576890']) ('+7', ['+71234567890', '+71234567854', '+71232267890'])
d = {}
lst = list(map(str, input().split()))
for i in lst:
    if f"+{i[1]}" in d.keys():
        d[f"+{i[1]}"].append(i)
    else:
        d[f"+{i[1]}"] = [i]

print(*sorted(d.items()))